app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'test' ORDER BY "users"."id" ASC LIMIT 1
---
	def do_login

		if params[:username].present? && params[:password].present?
	      found_user = User.where(:username => params[:username]).first